Run1234567/STM32-Web-FFT-Tuner/STM32F407/Library_RUN/RUN_PWM.h
#ifndef _RUN_PWM_H_
#define _RUN_PWM_H_

#include "stm32f4xx.h"

// ==============================================================================
// PWM 通道全集枚举 (严格适配 STM32F407)
// 命名格式：PWM_定时器_通道_引脚
// (不包含基本定时器 TIM6/TIM7，因为它们没有输出引脚)
// ==============================================================================
typedef enum {
    // -----------------------------------------------------------------------
    // TIM1 (高级定时器, APB2 168MHz, AF1)
    // -----------------------------------------------------------------------
    PWM_TIM1_CH1_PA8,  PWM_TIM1_CH1_PE9,
    PWM_TIM1_CH2_PA9,  PWM_TIM1_CH2_PE11,
    PWM_TIM1_CH3_PA10, PWM_TIM1_CH3_PE13,
    PWM_TIM1_CH4_PA11, PWM_TIM1_CH4_PE14,

    // -----------------------------------------------------------------------
    // TIM2 (通用定时器, APB1 84MHz, AF1)
    // -----------------------------------------------------------------------
    PWM_TIM2_CH1_PA0,  PWM_TIM2_CH1_PA5,  PWM_TIM2_CH1_PA15,
    PWM_TIM2_CH2_PA1,  PWM_TIM2_CH2_PB3,
    PWM_TIM2_CH3_PA2,  PWM_TIM2_CH3_PB10,
    PWM_TIM2_CH4_PA3,  PWM_TIM2_CH4_PB11,

    // -----------------------------------------------------------------------
    // TIM3 (通用定时器, APB1 84MHz, AF2)
    // -----------------------------------------------------------------------
    PWM_TIM3_CH1_PA6,  PWM_TIM3_CH1_PB4,  PWM_TIM3_CH1_PC6,
    PWM_TIM3_CH2_PA7,  PWM_TIM3_CH2_PB5,  PWM_TIM3_CH2_PC7,
    PWM_TIM3_CH3_PB0,  PWM_TIM3_CH3_PC8,
    PWM_TIM3_CH4_PB1,  PWM_TIM3_CH4_PC9,

    // -----------------------------------------------------------------------
    // TIM4 (通用定时器, APB1 84MHz, AF2)
    // -----------------------------------------------------------------------
    PWM_TIM4_CH1_PB6,  PWM_TIM4_CH1_PD12,
    PWM_TIM4_CH2_PB7,  PWM_TIM4_CH2_PD13,
    PWM_TIM4_CH3_PB8,  PWM_TIM4_CH3_PD14,
    PWM_TIM4_CH4_PB9,  PWM_TIM4_CH4_PD15,

    // -----------------------------------------------------------------------
    // TIM5 (通用定时器, APB1 84MHz, AF2)
    // -----------------------------------------------------------------------
    PWM_TIM5_CH1_PA0,  PWM_TIM5_CH1_PH10,
    PWM_TIM5_CH2_PA1,  PWM_TIM5_CH2_PH11,
    PWM_TIM5_CH3_PA2,  PWM_TIM5_CH3_PH12,
    PWM_TIM5_CH4_PA3,  PWM_TIM5_CH4_PI0,

    // -----------------------------------------------------------------------
    // TIM8 (高级定时器, APB2 168MHz, AF3)
    // -----------------------------------------------------------------------
    PWM_TIM8_CH1_PC6,  PWM_TIM8_CH1_PI5,
    PWM_TIM8_CH2_PC7,  PWM_TIM8_CH2_PI6,
    PWM_TIM8_CH3_PC8,  PWM_TIM8_CH3_PI7,
    PWM_TIM8_CH4_PC9,  PWM_TIM8_CH4_PI2,

    // -----------------------------------------------------------------------
    // TIM9 (通用定时器, APB2 168MHz, AF3)
    // -----------------------------------------------------------------------
    PWM_TIM9_CH1_PA2,  PWM_TIM9_CH1_PE5,
    PWM_TIM9_CH2_PA3,  PWM_TIM9_CH2_PE6,

    // -----------------------------------------------------------------------
    // TIM10 (通用定时器, APB2 168MHz, AF3)
    // -----------------------------------------------------------------------
    PWM_TIM10_CH1_PB8, PWM_TIM10_CH1_PF6,

    // -----------------------------------------------------------------------
    // TIM11 (通用定时器, APB2 168MHz, AF3)
    // -----------------------------------------------------------------------
    PWM_TIM11_CH1_PB9, PWM_TIM11_CH1_PF7,

    // -----------------------------------------------------------------------
    // TIM12 (通用定时器, APB1 84MHz, AF9)
    // -----------------------------------------------------------------------
    PWM_TIM12_CH1_PB14, PWM_TIM12_CH1_PH6,
    PWM_TIM12_CH2_PB15, PWM_TIM12_CH2_PH9,

    // -----------------------------------------------------------------------
    // TIM13 (通用定时器, APB1 84MHz, AF9)
    // -----------------------------------------------------------------------
    PWM_TIM13_CH1_PA6,  PWM_TIM13_CH1_PF8,

    // -----------------------------------------------------------------------
    // TIM14 (通用定时器, APB1 84MHz, AF9)
    // -----------------------------------------------------------------------
    PWM_TIM14_CH1_PA7,  PWM_TIM14_CH1_PF9,

    PWM_MAX
} RUN_PWM_enum;

// ==============================================================================
// 函数声明
// 注意：duty_cycle 参数范围变更为 0 ~ 10000 (代表 0.00% ~ 100.00%)
// ==============================================================================
void RUN_pwm_init(RUN_PWM_enum pwm_ch, uint32_t freq, uint16_t duty_cycle);
void RUN_pwm_set(RUN_PWM_enum pwm_ch, uint16_t duty_cycle);
void RUN_pwm_freq(RUN_PWM_enum pwm_ch, uint32_t freq);

#endif